<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <title>Cheet Sheet de HTML</title>
  </head>
  <body>
    <h2>Cheat Sheet de HTML</h2>
    <!--a Hyperlinks-->
    <h3>a - Hyperlinks</h3>
    <p>Sirven para hacer un link de una p&aacute;gina a otro recurso en la web, sea otro archivo en el servidor web, 
        u otra p&aacute;gina web.
    </p>
    <p>Por ejemplo: Si le da click <a href = "https://www.google.com.mx/">aqu&iacute;</a> lo llevara a la página de de Google</p>

    <!--p Paragraph-->
    <h3>p - Paragraph</h3>
    <p>Sirve para poner p&aacute;rrafos de texto, y que se puedan visualizar en la p&aacute;gina web.</p>
    <p>Un ejemplo de esto es lo que se est&aacute; viendo en este momento.</p>

    <!--h1 Header-->
    <h3>h1/h6 - Header</h3>
    <p>Sirve para poner encabezados dentro de la p&aacute;gina web. Empieza en h1 y temina en h6, esto define el tamaño que
        el encabezado va a tener. En pocas palabras es para establecer niveles a los encabezados dentro de una p&aacute;gina.
    </p>
    <p>Por ejemplo:</p>
    <h1>Encabezado princiapal (h1)</h1>
    <h2>Encabezado de nivel 2 (h2)</h2>
    <h3>Encabezado de nivel 3 (h3)</h3>
    <h4>Encabezado de nivel 4 (h4)</h4>
    <h5>Encabezado de nivel 5 (h5)</h5>
    <h6>Encabezado de nivel 6 (h6)</h6>

    <!--div-->
    <h3>div - Division</h3>
    <p>Se usa para crear secciones o agrupar contenido</p>
    <p>Ejemplo:</p>
    <div>
        <h4>Ejemplo de div</h4>
        <p>Esto es un párrafo dentro de un div</p>
    </div>

    <!--span-->
    <h3>span</h3>
    <p>Este es un contenedor en l&iacute;nea. Esto quiere decir que se usa para poder aplicar estilo al texto o agrupar elementos
        en l&iacute;nea. 
    </p>
    <p>Ejemplo: Empezamos a escribir <span style="color:red">y ahora hacemos uso de span</span></p>

    <!--i-->
    <h3>i - Italic</h3>
    <p>Este se utiliza para poder hacer que una palabra o letra se vuelva cursiva. Se usa para cambiar
        el tono de voz o tono alternativo
    </p>
    <p>Para poder utilizarlo se pone al principio de una letra o palabra.</p>
    <p>Por ejemplo: La tarea estuvo <i>f&aacute;cil</i></p>

    <!--u-->
    <h3>u</h3>
    <p>Mostrar el texto subrayado</p>
    <p>Ejemplo: Normal  <u>Subrayado</u></p>

    <!--b-->
    <h3>b - Bold</h3>
    <p>La b se utiliza para hacer que una palabra resalte, o en otras palabras negrillas. Para poder hacer uso de este
        lo que se debe de hacer es ponerlo justo antes de una palabra.
    </p>
    <p>Por ejemplo: Mi nombre es <b>Daniel</b></p>

    <!--strike-->
    <h3>strike</h3>
    <p>Sirve para poder tachar el texto. Subraya el texto con una l&iacute;nea horizontal por el medio.</p>
    <p>Por ejemplo: Normal <strike>Texto tachado.</strike></p>

    <!--small-->
    <h3>small</h3>
    <p>Usamos small para poder hacer el texto m&aacute;s chico. Pasamos de grande a mediano o de pequeño a m&aacute;s pequeño.</p>
    <p>Por ejemplo: <small>Texto m&aacute;s pequeño.</small></p>

    <!--strong-->
    <h3>strong - Strong</h3>
    <p>Se utiliza cuando queremos que una palabra tenga importancia. Del mismo modo que b, este pone en
        negrillas la palabra.
    </p>
    <p>Por ejemplo: <strong>Advertencia:</strong> tengo que hacer la tarea.</p>

    <!--em-->
    <h3>em - Italic (cursiva)</h3>
    <p>Es similar cuando se usa la i, pero la diferencia es que está se utiliza para hacer &eacute;nfasis en el texto</p>
    <p>Depende de tu texto es si vás a utilizar "i" o "em", su singificado sem&aacute;ntico</p>
    <p>Por ejemplo: <em>M&eacute;xico</em> es el mejor país.</p>

    <!--header-->
    <h3>header - Header/Encabezado</h3>
    <p>Este es utilizado para poder identificar la parte superior de una p&aacute;gina, suele incluir un encabezado, 
        un texto introductorio o navegación. Es un elemento estructural que describe el encabezado de un segmento de una p&aacute;gina.
    </p>
    <p>Por ejemplo:<header>En este apartado se ve como utilizar el header</header></p>

    <!--section-->
    <h3>section</h3>
    <p>Sirve para poder determinar que contenido corresponde a que parte del documento.</p>
    <p>Por ejemplo:</p>
    <section>
        <h4>Encabezado</h4>
        <p>P&aacute;rrafo</p>
    </section>

    <!--article-->
    <h3>articel - Artículo</h3>
    <p>Representa una composición auto-contenida en un documento, p&aacute;gina, sitio, etc. Que se quiere que sea distribuíble, reutilizable
        de manera independiente. Un ejemplo de esto se podr&iacute;a ver como, art&iacute;culo de revista o peri&oacute;dico, widget, comentario, etc.
    </p>
    <p>Por ejemplo:</p>
    <article>
        <h4>Comentarios de usuarios:</h4>
        <p>Esta p&aacute;gina me parece muy atractiva.</p>
    </article>

    <!--aside-->
    <h3>aside - Aside</h3>
    <p>Este elemento representa una secci&oacute;n de una p&aacute;gina que consiste en contenido que está indirectamente relacionado con el contenido principal del documento
        Son representadas como barras laterales o interseciones.
    </p>
    <p>Por ejemplo: Pueden ser, explicaciones al margen, publicidad, en p&aacute;ginas web informaci&oacute;n del perfil o enlaces a blogs relacionados.</p>

    <!--footer-->
    <h3>footer - Pie de p&aacute;gina</h3>
    <p>Para representar un pie de p&aacute;gina. Aqu&iacute; normalmente se encuentra informaci&oacute;n del autor, derechos de autor, enlaces o documentos relacionados.</p>
    <p>Ejemplo:</p>
    <footer>
        &copy;copyrights
    </footer>

    <!--nav-->
    <h3>nav - Navegation</h3>
    <p>Sección de los principales enlaces de navegación en una página. Este debe reservarse solo para secciones de
        navegación primaria, como navegación global, tabal de contenidos, enlaces anteriores/siguientes, u otros grupos
        de enlaces de navegación.
    </p>
    <p>Se vinculará a otras páginas dentro del mismo sitio web o a partes de la misma página web.</p>

    <!--img-->
    <h3>img - Im&aacute;gen</h3>
    <p>Poder mostrar una im&aacute;gen dentro de la p&aacute;gina</p>
    Ejemplo:<br>
    <img src="https://phpocean.com/assets/images/source-images/pics-articles/html-basics-introduction.png">

    <!--br-->
    <h3>br - Line Break/Salto de l&iacute;nea</h3>
    <p>Genera un salto de l&iacute;nea.</p>
    <p>Ejemplo:</p>
    Hola<br>
    como<br>
    estas

    <!--hr-->
    <h3>hr</h3>
    <p>Coloca una l&iacute;nea horizintal.</p>
    <p>Por ejemplo:</p>
    <p>Primer texto</p>
    <hr>
    <p>Texto separado por la l&iacute;nea horizontal.</p>

    <!--form-->
    <h3>form</h3>
    <p>Sirve para identificar una sección del documento en la cual hay controles interactivos
        los cuales le permiten a un usuario enviar informaci&oacute;n a un servidor web.
    </p>
    <p>Ejemplo:</p>
    <form action="/action_page.php" method="get">
        <label for="fname">Nombre:</label>
        <input type="text" id="fname" name="fname"><br><br>
        <label for="lname">Apellido:</label>
        <input type="text" id="lname" name="lname"><br><br>
        <input type="submit" value="Submit">
    </form>

    <!--table-->
    <h3>table</h3>
    <p>Poder representar informaci&oacute;n de manera de tabla. Los datos est&aacute;n organizados en columnas y filas
        haciendo uso del tag "tr" y "td" dentro de table. tr se usa para poder agregar una fila. td se utiliza para agregar una columna.
    </p>
    <p>Por ejemplo:</p>
    <table>
        <tr> <!--Fila-->
          <td>Column 1</td>
          <td>Column 2</td>
          <td>Column 3</td>
        </tr>
        <tr> <!--Fila-->
          <td>Column 1</td>
          <td>Column 2</td>
          <td>Column 3</td>
        </tr>
      </table>

    <!--ul-->
    <h3>ul</h3>
    <p>Sirve para hacer una lista con bullets.</p>
    <p>Ejemplo:</p>
    <ul>
        <li>Real Madrid</li>
        <li>España</li>
    </ul>

    <!--ol-->
    <h3>ol - Order List</h3>
    <p>Sirve para crear una lista ordenada, esta lista puede ser tanto num&eacute;rica como alfab&eacute;tica.
        El tag "li" es para definir cada elemento de la lista
    </p>
    <p>Por ejemplo: La primera es num&eacute;rica y la seguna es alfab&eacute;tica.</p>
    <ol>
        <li>Leche</li>
        <li>Pan</li>
    </ol>
    <ol style = "list-style-type:lower-alpha">
        <li>Leche</li>
        <li>Pan</li>
    </ol>

  </body>
</html>